web/html/tech/asio_executor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Thread-Pool Executor using Boost.ASIO</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Thread-Pool Executor using Boost.ASIO"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="07 September 2011"/>
<meta name="author" content="aldrin j d'souza"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Thread-Pool Executor using Boost.ASIO</h1>


<p>
Consider the problem of writing a thread pool executor: i.e. an abstraction that takes arbitrary
user defined tasks and executes them concurrently over a pool of threads. Here's a (slightly
overweight) <a href="http://download.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html">example</a> of the abstraction from <code>java.util.concurrent</code>. In this note, I describe another
(lean) implementation using a few bits from the treasure trove of <a href="http://www.boost.org/doc/libs/1_47_0/doc/html/boost_asio.html">Boost.ASIO</a>.
</p>
<p>
<a href="https://github.com/aldrin/ajd/blob/master/code/ajd/explore/test/src/executor_test.cc">Here's</a> what I expect from the executor (syntactically):
</p>
<p>
CANNOT INCLUDE FILE ../../code/ajd/explore/test/src/executor<sub>test</sub>.cc
</p>
<p>
I expect to create an executor with the specified number of threads in its pool and to have it ready
to jobs that I submit during the lifetime of the instance. The destructor must wait till the last
submitted job is completed and then clean up everything. As far as the tasks go, anything that is
invokable must be acceptable.
</p>
<p>
With those requirements in mind, <a href="https://github.com/aldrin/ajd/blob/master/code/ajd/explore/main/include/executor.h">here</a>'s an complete implementation:
</p>
<p>
CANNOT INCLUDE FILE ../../code/ajd/explore/main/include/executor.h
</p>
<p>
As someone who has written shabbily stitched executors in the past, I can't help but marvel at the
economy of this implementation. No dispatch queues, no mutexes to guard share state, no condition
variables to signal job arrivals, no shutdown flags, no nothing. Just the neat, power-packed
<code>asio::io_service</code> facade and we're done. Of course, there's still quite a bit left before we use
this in a complete application, but how cool is that for a start?
</p></div>

<div id="postamble">
<p class="date">Date: 07 September 2011</p>
<p class="author">Author: aldrin j d'souza</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
